Add Design doc
